Autodesk.Revit.DB.ATFXMLExportOptions.SetExportParameters(System.Boolean)
Used to control whether or not to export parameters.
exportParameters:
True to export parameters, false to not export parameters.

Autodesk.Revit.DB.ATFXMLExportOptions
ATF XML Export options.